[{"city": ["Montreal"], "practicing": ["Japanese"], "name": ["Tak"], "country": ["Canada"], "native": ["French", "English"], "desc": ["Hi\r\n\r\nI am a Canadian from Montreal. I speak French, English and Spanish. I would like to practice Japanese and teach you English or Spanish."]}, {"city": ["Marseille"], "practicing": ["French", "English"], "name": ["Quang Huy"], "country": ["France"], "native": ["Vietnamese", "French"], "desc": ["Bonjour,je suis vietnamien et j'ai 23 ans. Actuellement, je suis apprenti en dernière année de Master de l'informatique. Ca fait 5 ans que j'habite en France (Je suis un peu timide) mais je souhaiterais évoluer encore mon français.\r\nHi, I'm studying for a Master degree in IT. I just would like to pratice French and English for improving my language and communication skills and meeting new peoples"]}, {"city": ["Quebec"], "practicing": ["English"], "name": ["Pier"], "country": ["Canada"], "native": ["French"], "desc": ["I'm looking for conversation English/French language exchange partners.\r\n\r\nI'm a software analyst, I like sports, outdoors activities and riding horses.\r\n\r\nJe suis très patient et j'ai un bon sens de l'humour.\r\n\r\nFeel free to contact me, I'll be happy to talk with you and help you with French language. \r\n\r\nÀ bientôt."]}, {"city": ["Delémont"], "practicing": ["Korean", "Chinese, Cantonese", "Japanese", "Chinese, Mandarin"], "name": ["Dana"], "country": ["Switzerland"], "native": ["French", "English"], "desc": ["Hi ! \r\nMy name's Dana,I'm 16yo(nearly 17), I'm from Switzerland and I really want to learn more about Korea, China and Japan as well (language, culture etc..), because I wanna travel there to work maybe..  I wanna make friends and talk about everything ! I also want to improve my english which is not that good.. ! Feel free to send me a 'hi!' or an email or my 카카오톡 is PinkHipster. I hope we can be friends ❤😊"]}, {"city": ["Bonn"], "practicing": ["German"], "name": ["Siraj"], "country": ["Germany"], "native": ["Arabic, Moroccan", "French", "- Other -"], "desc": ["Hey! My name is Siraj, and I'm looking to improve my German skills. In return I can help you with your French or Arabic ;)\r\nI love meeting people from all over the world and discovering their cultures... it's always an exciting experience."]}, {"city": ["Montargis"], "practicing": ["English", "Spanish"], "name": ["Caroline"], "country": ["France"], "native": ["French"], "desc": ["Bonjour,\r\nJe recherche des personnes pour dialoguer d'abord à l'écrit (car mon niveau n'est pas super...) puis à l'oral et pourquoi pas en vrai autour d'un verre! Je souhaite améliorer mon niveau d'anglais et d'espagnol car j'adore voyager et c'est plus simple quand on parle bien l'anglais (ou l'espagnol, en fonction du lieu de vacances). Je suis enseignante en école élémentaire et j'ai un peu honte quand j'enseigne l'anglais à mes élèves... ;-p Je ne suis pas un membre gold"]}, {"city": ["Cholet"], "practicing": ["English", "Spanish", "Portuguese"], "name": ["Jean"], "country": ["France"], "native": ["French"], "desc": ["Hello everyone,\r\nMy name is Jean, I am 24 years old and I live in France. What i like the most is traveling with friends, learning languages and chatting on the internet. Since I work at night i have plenty of time during the day to exercise on my English or Spanish. Now I would like to meet people and try to speak with English/Spanish/portuguese speakers. And for those who wish like to learn French i would be happy to help or have full conversations with them. If you live near my town, we could eventually meet up !\r\nIf you're interested by my profile please contact me or send my a 'Hi', i will answer you ^^ (i am gold member)"]}, {"city": ["Francières"], "practicing": ["English"], "name": ["Elisabeth"], "country": ["France"], "native": ["French"], "desc": ["Hello,\r\nI want to improve  my English . I'm looking for  people  to exchange our native language (mine is French).I love horses, classical music,painting, museums,history, biographies, gardening .\r\n\r\nI'm a Gold member."]}, {"city": ["Innsbruck"], "practicing": ["German"], "name": ["Lucie"], "country": ["Austria"], "native": ["French"], "desc": ["Hi ! I come from France, arrived a few weeks ago in Innsbruck, and I am looking for someone to improve my German. \r\nDe mon cote, je peux t´aider a entretenir et ameliorer ton Francais ;). \r\nFrom my previous experience of 'Sprachtandems', I think the best to really practice is to meet on a regular basis for a coffee / tea / whatever you like.\r\n\r\nI am a big movie / books / music fan, studied History and literature (a long time ago...I am an old 27 years old woman already), and am pretty open to...all kind of topics!"]}, {"city": ["Le Mans"], "practicing": ["English"], "name": ["Pierre-Alain"], "country": ["France"], "native": ["French"], "desc": ["Hi, I'm excited to meet people who speak english in order to discover different cultures and way of life while improving my english. I'd be glad to help your French in return :)"]}]